export interface QuestionOption {
  title: string;
  options: string[];
  order?: "ascending" | "descending";
}

export const QuestionOptions: QuestionOption[] = [
  {
    title: "以下哪一项能够最准确描述您在过去六个月所感受的疼痛:",
    options: ["无疼痛", "轻微", "中度", "中等至严重", "严重"],
  },
  {
    title: "以下哪一项能够准确描述您过去一个月所感受的疼痛:",
    options: ["无疼痛", "轻微", "中度", "中等至严重", "严重"],
  },
  {
    title: "总体来说，在过去六个月期间您感到十分焦虑吗？",
    options: ["完全没有", "小部分时间", "有时", "大部分时间", "全部时间"],
  },
  {
    title: "如果您必须在背部维持现状不变的情况下继续生活，您会有什么感受:",
    options: [
      "十分愉快",
      "某种程度上愉快",
      "没有愉快或不愉快",
      "某种程度上不愉快",
      "十分不愉快",
    ],
  },
  {
    title: "您现在的活动能力如何？",
    options: [
      "只限于床上",
      "基本上不活动",
      "轻度的运动及劳动，如家务活",
      "中等的运动及劳动，如骑车",
      "活动不受限制",
    ],
    order: "descending",
  },
  {
    title: "您在穿上衣服后外观如何？",
    options: ["很好", "好", "可以接受", "差劲", "十分差劲"],
  },
  {
    title: "在过去六个月期间您曾感到十分沮丧以至于任何事物也不能让您开心吗？",
    options: ["总是", "经常", "有时", "很少数时间", "完全没有"],
    order: "descending",
  },
  {
    title: "您在休息时有背部疼痛吗？",
    options: ["总是", "经常", "有时", "很少数时间", "完全没有"],
    order: "descending",
  },
  {
    title: "你目前的工作 / 学习活动状况怎样？",
    options: [
      "完全正常",
      "有正常的 75%",
      "有正常的 50%",
      "有正常的 25%",
      "完全不正常",
    ],
  },
  {
    title:
      "以下哪一项最确切描述了你的躯干外形（躯干指的就是人除了头颅和四肢外的其余部分）",
    options: ["很好", "好", "还可以", "不好", "很不好"],
  },
  {
    title: "以下哪一项最确切描述你为治疗背部的用药情况？",
    options: [
      "没有",
      "每周或少于 1 周使用非麻醉药（例如：阿司匹林，扑热息痛（商品名：必理痛），布洛芬）",
      "每周或少于 1 周使用麻醉药（例如：扑热息痛Ⅲ，盐酸羟考酮（商品名：奥施康定），对乙酰氨基酚片剂（商品名：服必宁））",
      "每天使用麻醉药",
      "其他：用药名称用药方法（每周或少于 1 周或每天）",
    ],
  },
  {
    title: "你的背部是否限制你做家务？",
    options: ["从不", "很少", "有时候", "经常", "很经常"],
  },
  {
    title: "在过去的 6 个月你感到心情平和吗？",
    options: ["一直是", "大部分时间是", "有时候是", "很少有", "没有"],
  },
  {
    title: "你感到你的背部情况影响你的人际关系吗？",
    options: [
      "没有影响",
      "稍有点影响",
      "有轻度影响",
      "有中度影响",
      "有严重影响",
    ],
  },
  {
    title: "是否曾由于你的背部情况导致你或你的家庭经济困难？",
    options: ["很严重", "中度的", "轻度的", "稍有点", "没有"],
    order: "descending",
  },
  {
    title: "在过去的 6 个月你曾感到心情沮丧吗？",
    options: ["从没有", "很少有", "有时有", "经常有", "很常有"],
  },
  {
    title:
      "在过去的 3 个月你曾因背痛向老师请过病假吗？如有，请说明请了几天病假",
    options: ["0天", "1天", "2天", "3天", "4天或更多"],
  },
  {
    title: "你出去玩的时候比你的朋友多还是少？",
    options: ["多得多", "多", "一样", "少", "少得多"],
  },
  {
    title: "你对自己目前的背部外观感到满意吗？",
    options: ["很满意", "有点满意", "一般", "不那么满意", "根本不满意"],
  },
  {
    title: "在过去的 6 个月感到快乐吗？",
    options: [
      "从不感到快乐",
      "很少感到快乐",
      "有时感到快乐",
      "大部分时间感到快乐",
      "一直感到快乐",
    ],
    order: "descending",
  },
  {
    title: "你对你的背部治疗结果感到满意吗？",
    options: ["很满意", "满意", "一般", "不满意", "很不满意"],
  },
  {
    title: "如果你有同样的病情，你将愿意再次采取同样的治疗吗？",
    options: ["肯定愿意", "很可能愿意", "不确定", "很可能不愿意", "肯定不愿意"],
  },
];

export interface QuestionAnswer {
  index: number;
  score: number;
}

export interface Questionnaire {
  id: number;
  patient_id: number;
  created_at: number;
  score: number;
}
